Tekla Open API Reference for Tekla Structures 2025
ControlArc Constructor
Overload List
Name | Description
ControlArc()
 Creates a new control arc instance.
The default values are as follows:
CenterPoint = Point(0.0, 0.0, 0.0);
StartPoint = Point(0.0, 1000.0, 0.0);
EndPoint = Point(1000.0, 0.0, 0.0);
Color = ControlObjectColorEnum.YELLOW;
ControlArc(Point, Point, Point)
 Creates a new control arc instance taking the 3 points.
Top
See Also
Reference
ControlArc Class
Tekla.Structures.Model Namespace